RedditClone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asdlkfjasdkfhjasldkjhasldkfjhaslkdjfhasdf"], ["author_id", 3], ["post_id", 13], ["created_at", "2018-07-18 00:10:22.467593"], ["updated_at", "2018-07-18 00:10:22.467593"]]
---
  def create
    @comment = Comment.new(content: params[:comment][:content])
    @comment.author_id = current_user.id
    @comment.post_id = params[:post_id]
    if @comment.save