RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id
    if @post.save
---
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 7], ["sub_id", 2], ["created_at", "2018-07-17 23:20:21.024494"], ["updated_at", "2018-07-17 23:20:21.024494"]]
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "with inverse"], ["url", "inverse"], ["content", "inversion"], ["author_id", 3], ["created_at", "2018-07-17 23:20:21.021290"], ["updated_at", "2018-07-17 23:20:21.021290"]]

  def update
    @post = Post.find_by(id: params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "sdgfasdfasdfasdfasdfaksdhf"], ["updated_at", "2018-07-17 21:10:46.967075"], ["id", 3]]