RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Sub for discussion"], ["updated_at", "2018-07-17 18:57:27.706313"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update_attributes(sub_params)