RedditClone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <ul>
    <% Sub.all.each do |sub| %>